In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])

In [14]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [15]:
df.sort_values('key')

  key  data
0   A     0
3   A     3
1   B     1
4   B     4
2   C     2
5   C     5

In [17]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [8]:
df.groupby('key').count()

     data
key
A       2
B       2
C       2

In [9]:
df.groupby('key').max()

     data
key
A       3
B       4
C       5

In [21]:
df.groupby('key')['data'].sum()

key
A    3
B    5
C    7
Name: data, dtype: int64

In [25]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [26]:
df.sort_values('key')

  key  data1  data2
0   A      0      5
3   A      3      3
1   B      1      0
4   B      4      7
2   C      2      3
5   C      5      9

In [27]:
df.groupby('key')['data1'].sum()

key
A    3
B    5
C    7
Name: data1, dtype: int64

In [31]:
df.groupby('key').aggregate(['min',np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [36]:
df.groupby('key').aggregate({'data1':min,
                             'data2':max})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [35]:
df.groupby('key').aggregate({'data1':[min,np.median],
                             'data2':max})

    data1        data2
      min median   max
key
A       0    1.5     5
B       1    2.5     7
C       2    3.5     9

In [37]:
def filterd(x):
    return x['data2'].mean()>4

In [39]:
df.groupby('key').filter(filterd)

  key  data1  data2
2   C      2      3
5   C      5      9

In [40]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [43]:
df.groupby('key').sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [45]:
df.groupby('data1').transform(lambda x: "hi")

  key data2
0  hi    hi
1  hi    hi
2  hi    hi
3  hi    hi
4  hi    hi
5  hi    hi

In [46]:
df.groupby('key').transform(lambda x: x+10)

   data1  data2
0     10     15
1     11     10
2     12     13
3     13     13
4     14     17
5     15     19